#include ".h files\Class_CFiles.h"

void CFiles::Create_file()///Создание файла и папки для него
{
    system("cls");
    cout << "Для возвращения в меню, напишите back" << '\n';
    cout << "====================================================================================" << '\n';
    cout << "Напишите имя папки, куда хотите создать файл, потом / и имя файла с его расширением" << '\n';
    cin >> file_creaate;
    ofstream txt_file(file_creaate);///Функция из класса <fstream>, которая создает файл
    cout << "Файл создан" << '\n';
    Sleep(2000);
}

void CFiles::Edit_file()///Редактирование файла
{
    system("cls");
    cout << "Для возвращения в меню, напишите back" << '\n';
    cout << "==============================================================================" << '\n';
    cout << "Напишите start, откроеться консоль и введите start, папку, файл с расширением" << '\n';
    cin >> file_edit;
    system(file_edit);
}

void CFiles::View_file()///Показ файла
{
    system("start DB");
}

int CFiles::View_DB()///Показ Базы данных
{
    cout << "=================================================" << '\n';
    cout << "Для возвращения в меню, напишите back" << '\n';
    cout << "======================================================================" << '\n';
    cout << "Введите команду start ,откроеться консоль и введите start и имя папки" << '\n' << '\n';
    cin >> command;
    if(command == "back" or command == "exit")
    {
        return 1;
    }
    system(command);
    system("cls");
}

void CFiles::Delete_file()///Удаление файла
{
    system("cls");
    cout << "Для возвращения в меню, напишите back" << '\n';
    cout << "==========================================================" << '\n';
    cout << "Напишите имя папки, потом / и имя файла с его расширением" << '\n';
    cin >> file_delete;
    remove(file_delete);///Функция из класса <fstream>, которая удаляет файл
    cout << "Файл удален" << '\n';
    Sleep(1000);
}

void CFiles::loading()
{
    for(int i = 0; i < 5; i++)
    {
        cout << ".";
        Sleep(500);
    }
}
