///Написать программу, которая выводит на экран ваше имя и фамилию.
#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "RUS");
    cout << "Басыров Сергей Амирович";
}
